In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [31]:
df_train = pd.read_csv('adult.data', header=None)

In [32]:
df_train.head(2)

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K

In [33]:
df_test = pd.read_csv('adult.test', header=None)

In [34]:
df_test.head(2)

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,25,Private,226802,11th,7,Never-married,Machine-op-inspct,Own-child,Black,Male,0,0,40,United-States,<=50K.
1,38,Private,89814,HS-grad,9,Married-civ-spouse,Farming-fishing,Husband,White,Male,0,0,50,United-States,<=50K.

In [35]:
# 학습/테스트 데이터를 합쳐서 전처리를 합니다
df = pd.concat((df_train, df_test))
df.shape

(48842, 15)

In [36]:
#컬럼이름을 알기 쉽게 바꿔줍니다
col = ['age','workclass','fnlwgt','education','education-num','marital-status','occupation','relationship'
,'race','sex','capital-gain','capital-loss','hours-per-week','native-country','income']
df.columns = col
len(col)

15

In [37]:
df.iloc[:, -1].unique()

array([' <=50K', ' >50K', ' <=50K.', ' >50K.'], dtype=object)

In [38]:
# income 값에 . 이 붙어 있어서 지워줍니다
df = df.replace(' <=50K.', ' <=50K', regex=True)
df = df.replace(' >50K.', ' >50K', regex=True)

In [39]:
df.iloc[:, -1].unique()

array([' <=50K', ' >50K'], dtype=object)

In [40]:
df_hot = pd.get_dummies(df)

In [50]:
#맨 뒤의 컬럼은 사용하지 않습니다
y = df_hot['income_ <=50K']
X = df_hot.iloc[:, :-2]
X.shape, y.shape

((48842, 108), (48842,))

In [55]:
df.head(2)

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,income
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K

In [54]:
df_hot.head(2)

,age,fnlwgt,education-num,capital-gain,capital-loss,hours-per-week,workclass_ ?,workclass_ Federal-gov,workclass_ Local-gov,workclass_ Never-worked,...,native-country_ Scotland,native-country_ South,native-country_ Taiwan,native-country_ Thailand,native-country_ Trinadad&Tobago,native-country_ United-States,native-country_ Vietnam,native-country_ Yugoslavia,income_ <=50K,income_ >50K
0,39,77516,13,2174,0,40,0,0,0,0,...,0,0,0,0,0,1,0,0,1,0
1,50,83311,13,0,0,13,0,0,0,0,...,0,0,0,0,0,1,0,0,1,0

In [56]:
X.head(2)

,age,fnlwgt,education-num,capital-gain,capital-loss,hours-per-week,workclass_ ?,workclass_ Federal-gov,workclass_ Local-gov,workclass_ Never-worked,...,native-country_ Portugal,native-country_ Puerto-Rico,native-country_ Scotland,native-country_ South,native-country_ Taiwan,native-country_ Thailand,native-country_ Trinadad&Tobago,native-country_ United-States,native-country_ Vietnam,native-country_ Yugoslavia
0,39,77516,13,2174,0,40,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0
1,50,83311,13,0,0,13,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0

In [42]:
X_norm = (X - np.min(X, axis=0))/(np.max(X, axis=0) - np.min(X, axis=0)) #정규화 [0, 1]

In [43]:
m_train = len(df_train)
X_train = X_norm[:m_train]
X_test = X_norm[m_train:]
y_train = y[:m_train]
y_test = y[m_train:]

In [45]:
from sklearn.tree import DecisionTreeClassifier
model = DecisionTreeClassifier(max_depth=5).fit(X_train, y_train)
model.score(X_train, y_train), model.score(X_test, y_test)

(0.8520929946868954, 0.8520361157177078)

In [47]:
from sklearn.ensemble import GradientBoostingClassifier, AdaBoostClassifier
model = GradientBoostingClassifier().fit(X_train, y_train)
model.score(X_train, y_train), model.score(X_test, y_test)

(0.8690457909769356, 0.8712609790553406)

In [48]:
from sklearn.ensemble import RandomForestClassifier
model = RandomForestClassifier(n_estimators=100,max_depth=10).fit(X_train, y_train)
model.score(X_train, y_train), model.score(X_test, y_test)

(0.8629034734805442, 0.8574411891161476)

In [49]:
from sklearn.neural_network import MLPClassifier
model = MLPClassifier(hidden_layer_sizes=(50,50)).fit(X_train, y_train)
model.score(X_train, y_train), model.score(X_test, y_test)

C:\Users\wtime\Anaconda3\lib\site-packages\sklearn\neural_network\multilayer_perceptron.py:562: ConvergenceWarning: Stochastic Optimizer: Maximum iterations (200) reached and the optimization hasn't converged yet.
  % self.max_iter, ConvergenceWarning)

(0.895089217161635, 0.8396290154167434)